Autodesk.Revit.DB.Structure.RebarConstraintsStatus
Describes the status of the constraints
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraintsStatus.SomeDisabled
Some constraints are disabled, and the others or enabled.

Autodesk.Revit.DB.Structure.RebarConstraintsStatus.AllDisabled
All constraints are disabled.

Autodesk.Revit.DB.Structure.RebarConstraintsStatus.Enabled
All constraints are enabled.